## 
## Cadence First Encounter "v08.10-s273_1 ((32bit) 06/16/2009 02:26 (Linux 2.6))"
## Thu Oct 10 05:13:52 2013
## 
set sdc_version 1.4
current_design mips
create_clock [get_ports {clk}]  -name clk -period 19 -waveform {0 5}
set_propagated_clock  [get_ports {clk}]
set_input_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[10]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[12]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[9]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[10]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[7]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[5]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[3]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[1]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[8]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[6]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[15]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[4]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[13]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[2]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[15]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[11]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[0]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[13]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[11]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[8]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[6]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[4]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[2]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[9]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[0]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[7]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[5]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[14]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[3]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {alu_result[12]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[1]}]
set_output_delay -add_delay 2 -max -clock [get_clocks {clk}] [get_ports {pc_out[14]}]
set_clock_uncertainty 0.35 [get_clocks {clk}]
set_false_path -hold  -from [get_ports {reset}] 
set_false_path -hold  -to [get_ports {alu_result[14] alu_result[15] pc_out[0] pc_out[1] pc_out[2] alu_result[0] pc_out[3] alu_result[1] pc_out[4] alu_result[2] pc_out[5] alu_result[3] pc_out[6] alu_result[4] pc_out[7] alu_result[5] pc_out[8] alu_result[6] pc_out[9] alu_result[7] pc_out[10] alu_result[8] pc_out[11] alu_result[9] pc_out[12] alu_result[10] pc_out[13] alu_result[11] pc_out[14] alu_result[12] pc_out[15] alu_result[13]}] 
